Revit 2027 API
Alignment.DisplayedStartStation Property
 Specifies the station at which the alignment's display starts, in Revit internal model units (standard Imperial feet).
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DisplayedStartStation { get; }
Public ReadOnly Property DisplayedStartStation As Double
	Get
public:
property double DisplayedStartStation {
	double get ();
}
member DisplayedStartStation : float with get
Property Value
Double
Remarks
 This station is within the alignment's geometric definition range (StartStation, EndStation).
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace